# cli tool
brew "aws/tap/copilot-cli"
brew "ghq"
brew "git"
brew "gh"
brew "circleci"
brew "git-secrets"
brew "fzf"
cask "ngrok"
brew "the_silver_searcher"
brew "tig"
brew "tmux"
brew "vim"
brew "wget"
brew "youtube-dl"
brew "zsh"

# programming language
brew "python"
brew "gcc"
brew "clang-format"
brew "go"
brew "python@2"
brew "ruby"
brew "java"
brew "sbt"

# ctags
tap "universal-ctags/universal-ctags"
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]

# db
brew "sqlite"
brew "mysql@5.7", restart_service: true
brew "postgresql"
brew "postgresql@10"

# rails
brew "graphviz"
brew "readline", link: true
brew "imagemagick"
brew "libxml2"

# docker/kubernetes
brew "hadolint"
brew "kind"
tap "eugenmayer/dockersync"
brew "eugenmayer/dockersync/unox"
brew "unison"

# static site generator
brew "hugo"

# JavaScript
# JavaScript Engine
# brew "spidermonkey"

# heroku cli
tap "heroku/brew"
brew "heroku/brew/heroku"

# terraform tool
brew "terraformer"

# json
brew "jq"

# no longer needed?
tap "homebrew/cask"
tap "homebrew/cask-drivers"

# ping tool
tap "nnao45/pexpo"
brew "nnao45/pexpo/pexpo"

brew "ffmpeg"
brew "gawk"
brew "inetutils"

brew "mkcert"

brew "peco"

brew "pipenv"
brew "protobuf"
brew "pv"
brew "sphinx-doc"

# cask
cask "grammarly"
cask "blackhole"
cask "raspberry-pi-imager"
cask "libreoffice-language-pack"
cask "deepl"
cask "authy"
cask "keepassxc"
# cask "skitch"
cask "gyazo"
