# Git & Version Control
brew "git"
brew "gh"
brew "git-secrets"
brew "tig"
brew "lazygit"
brew "ghq"

# Terminal
cask "ghostty"

# CLI Tools & Utilities
brew "fzf"
brew "peco"
brew "the_silver_searcher"
brew "jq"
brew "wget"
brew "tmux"
brew "gawk"
brew "inetutils"
brew "bitwarden-cli"

# Modern CLI replacements
brew "rtk"       # CLI output compressor for Claude Code (token reduction)
brew "bat"       # cat with syntax highlighting
brew "eza"       # ls with colors, icons, git status
brew "fd"        # find, faster and user-friendly
brew "ripgrep"   # grep, faster (rg)
brew "dust"      # du with visual tree
brew "bottom"    # top/htop replacement (btm)
brew "procs"     # ps with colors and search
brew "hyperfine" # command-line benchmarking tool

# Editors
brew "vim"
brew "neovim"

# Shells
brew "zsh"
brew "bash"

# AWS & Cloud
brew "aws/tap/copilot-cli"
brew "circleci"

# Programming Languages & Tools
brew "python"
brew "gcc"
brew "clang-format"
brew "go"
brew "java"
brew "sbt"

# Ruby Build Dependencies
# ref: https://github.com/rbenv/ruby-build/wiki#suggested-build-environment
brew "openssl@3"
brew "readline"
brew "libyaml"
brew "gmp"
brew "autoconf"

# Docker & Kubernetes
brew "docker"
brew "hadolint"
brew "kind"

# Development Tools
brew "hugo"
brew "mkcert"
brew "protobuf"

# Media & Audio
brew "ffmpeg"
brew "blackhole-2ch"

# GUI Applications (Casks)
cask "libreoffice-language-pack"
cask "deepl"
cask "keepassxc"
cask "gyazo"
cask "ngrok"
cask "kiro"
cask "aws-vault"
cask "chatgpt"
cask "claude"
cask "keyclu"
cask "raycast"
cask "bitwarden"
